In [1]:
import pandas as pd
import numpy as np

In [30]:
data = {
    'Estudante' : ['João', 'Maria', 'João', 'Maria'],
    'Disciplina' : ['Matemática', 'Matemática', 'História', 'História'],
    'Nota' : [85, 90, 75, 80]
}

In [31]:
df = pd.DataFrame(data, columns=['Estudante', 'Disciplina', 'Nota'])
df

  Estudante  Disciplina  Nota
0      João  Matemática    85
1     Maria  Matemática    90
2      João    História    75
3     Maria    História    80

In [32]:
import pandas as pd
import sqlite3

# Create a temporary table using SQLite
conn = sqlite3.connect(':memory:')
cursor = conn.cursor()

In [33]:
df.to_sql('Notas', conn, if_exists='replace', index=False)

4

In [42]:
# Execute SQL query

sql = """
    SELECT Estudante,
        SUM(CASE WHEN Disciplina = 'Matemática' THEN Nota ELSE 0 END) AS Matemática,
        SUM(CASE WHEN Disciplina = 'História' THEN Nota ELSE 0 END) AS História
    FROM Notas
    GROUP BY Estudante
"""
cursor.execute(sql)

# Retrieve results as DataFrame
results_df = pd.read_sql_query(sql, conn)

# Print the results DataFrame
print(results_df)

  Estudante  Matemática  História
0      João          85        75
1     Maria          90        80